import matplotlib.pyplot as plt
import numpy as np

# =======================================================================

"""x = [2, 6, 8, 14, 20]
y = [6, 4, 10, 12, 16]

plt.plot(x, y)

plt.title("Пример простого линейного графика")

plt.xlabel("Ось Х")
plt.ylabel("Ось Y")

plt.show()"""

# =======================================================================

"""data = [5, 6, 7, 4, 6, 5, 7, 8, 5, 8, 9, 10, 11, 8, 9, 5, 6, 7, 4, 6, 5, 7, 8, 5, 8, 9, 10, 11, 8, 9]


plt.hist(data, bins=3)

plt.title("Гистограмма количества часов сна")

plt.xlabel("Часы сна")
plt.ylabel("Количество людей")

plt.show()"""

# =======================================================================

"""x = [1, 4, 6, 7, 10]
y = [3, 5, 8, 10, 15]


plt.scatter(x, y)

plt.title("Тестовая диаграмма рассеивания")

plt.xlabel("Ось Х")
plt.ylabel("Ось Y")

plt.show()"""

# =======================================================================

"""a = np.array([1, 2, 3, 4])

print(a)

a = np.zeros((3, 3))

print(a)

a = np.ones((2, 5))

print(a)

a = np.random.random((4, 5))

print(a)

a = np.arange(0, 10, 2)

print(a)

a = np.linspace(0,13,10)

print(a)"""

# =======================================================================

x = np.linspace(-10,10,100)

y = x**2

plt.plot(x, y)

plt.title("График функции y = x**2")

plt.xlabel("Ось Х")
plt.ylabel("Ось Y")

plt.grid(True)

plt.show()
